# DesignOptionConflictError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..DesignOptionConflictError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The solution is failing to do the elements are not in the same Design Option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DesignOptionConflictError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DesignOptionConflictError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DesignOptionConflictError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace